{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense0_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense1_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense2_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense2_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(4, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(4,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense3_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "variationalautoencoder12_split0", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "variationalautoencoder12__mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[16, 1, 0]]
    }, 
    {
      "op": "exp", 
      "name": "variationalautoencoder12_exp0", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "_random_normal", 
      "name": "variationalautoencoder12__random_normal0", 
      "attrs": {
        "loc": "0", 
        "scale": "1", 
        "shape": "(100, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "variationalautoencoder12__mul0", 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "variationalautoencoder12__plus0", 
      "inputs": [[16, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense4_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense4_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense5_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense5_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense5_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense6_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense6_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense6_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1568, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "variationalautoencoder12_dense7_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1568,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "variationalautoencoder12_dense7_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "1568"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "variationalautoencoder12_dense7_sigmoid_fwd", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "variationalautoencoder12_split1", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[37, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    9, 
    10, 
    13, 
    14, 
    22, 
    23, 
    26, 
    27, 
    30, 
    31, 
    34, 
    35
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    41
  ], 
  "heads": [[38, 0, 0], [38, 1, 0], [16, 0, 0], [16, 1, 0]], 
  "attrs": {"mxnet_version": ["int", 10700]}
}